Revit 2024 API
ShapeImporterSourceFormat Enumeration
 An enumerated type listing the possible formats supported by the Shapeimporter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Since: 2017
Syntax
C#
public enum ShapeImporterSourceFormat
Visual Basic
Public Enumeration ShapeImporterSourceFormat
Visual C++
public enum class ShapeImporterSourceFormat
Members
Member name | Description
Auto |  The format of the incoming data will be determined from input file extension.
SAT |  The incoming data is in SAT format (*.sat).
Rhino |  The incoming data is in Rhino format (*.3dm).
SketchUp |  The incoming data is in SketchUp format (*.skp).
OBJ |  The incoming data is in OBJ format (*.obj).
STL |  The incoming data is in STL format (*.stl).
See Also
Autodesk.Revit.DB Namespace